In [18]:
import pandas as pd
import numpy as np

# data dictionary

data ={
    'Name': ['Alice', 'Bob', 'Naved', 'David'],
    'Age': [24, np.nan, 56, 1000],
    'City': ['New York', 'Austin', 'Cupertino', np.nan],
    'Salary': [70000, 80000, np.nan, 90000]
}

df = pd.DataFrame(data=data)

print(df)

    Name     Age       City   Salary
0  Alice    24.0   New York  70000.0
1    Bob     NaN     Austin  80000.0
2  Naved    56.0  Cupertino      NaN
3  David  1000.0        NaN  90000.0

In [19]:
df['Age'] = df['Age'].fillna(30)
df['Salary'] = df["Salary"].fillna(1.2000)
df['City'] = df['City'].fillna('Unknown')

In [20]:
df

    Name     Age       City   Salary
0  Alice    24.0   New York  70000.0
1    Bob    30.0     Austin  80000.0
2  Naved    56.0  Cupertino      1.2
3  David  1000.0    Unknown  90000.0